meeting-room-booking/app/serializers/api_serializer.rb

  def room(room)
    {
      id: room.id,
      name: room.name,
      capacity: room.capacity,
      floor: room.floor,
      amenities: room.room_amenities.map(&:amenity)
---
SELECT `room_amenities`.* FROM `room_amenities` WHERE `room_amenities`.`room_id` = 4