meeting-room-booking/app/controllers/bookings_controller.rb

  def create
    booking = BookingService.create(
      booking_params.to_h,
      request.headers["Idempotency-Key"]
    )
---
INSERT INTO `bookings` (`room_id`, `title`, `organizer_email`, `start_time`, `end_time`, `status`, `created_at`, `updated_at`) VALUES (1, 'Daily Standup', 'john@example.com', '2026-06-15 09:00:00', '2026-06-15 10:00:00', 'confirmed', '2026-06-14 07:12:45.752075', '2026-06-14 07:12:45.752075')
INSERT INTO `idempotency_keys` (`key`, `organizer_email`, `booking_id`, `request_hash`, `status`, `created_at`, `updated_at`) VALUES ('booking-001', 'john@example.com', NULL, 'e34317d8f8f30dbb72819c3692afca258056c654d7dbb3f3b3ca321944f90509', 'processing', '2026-06-14 07:26:06.673274', '2026-06-14 07:26:06.673274')