meeting-room-booking/app/controllers/rooms_controller.rb

INSERT INTO `rooms` (`name`, `capacity`, `floor`, `created_at`, `updated_at`) VALUES ('Orion', 10, 2, '2026-06-14 06:48:00.980654', '2026-06-14 06:48:00.980654')
---
  def create
    room = RoomService.create(room_params)