meeting-room-booking/app/services/booking_service.rb

    def list(params)
      bookings = Booking.order(:start_time)

      if params[:room_id].present?
        bookings = bookings.where(room_id: params[:room_id])
      end

      if params[:from].present?
        from_time = Time.iso8601(params[:from].to_s)
        bookings = bookings.where("end_time > ?", from_time)
      end

      if params[:to].present?
        to_time = Time.iso8601(params[:to].to_s)
        bookings = bookings.where("start_time < ?", to_time)
      end

      total = bookings.count
---
SELECT COUNT(*) FROM `bookings` WHERE `bookings`.`room_id` = 2

    def create_with_idempotency(params, idempotency_key)
      organizer_email = params[:organizer_email]
      request_hash = request_fingerprint(params)

      existing = IdempotencyKey.find_by(
        key: idempotency_key,
        organizer_email: organizer_email
      )

      if existing
        return handle_existing_idempotency(existing, request_hash)
      end

      begin
        booking = nil

        Booking.transaction do
          idempotency_record = IdempotencyKey.create!(
            key: idempotency_key,
            organizer_email: organizer_email,
            request_hash: request_hash,
            status: IdempotencyKey::PROCESSING
          )

          booking = create_booking!(params)

          idempotency_record.update!(
            booking: booking,
            status: IdempotencyKey::COMPLETED
          )
---
SELECT `idempotency_keys`.* FROM `idempotency_keys` WHERE `idempotency_keys`.`key` = 'booking-001' AND `idempotency_keys`.`organizer_email` = 'john@example.com' LIMIT 1
INSERT INTO `idempotency_keys` (`key`, `organizer_email`, `booking_id`, `request_hash`, `status`, `created_at`, `updated_at`) VALUES ('booking-001', 'john@example.com', NULL, 'e34317d8f8f30dbb72819c3692afca258056c654d7dbb3f3b3ca321944f90509', 'processing', '2026-06-14 07:26:06.673274', '2026-06-14 07:26:06.673274')
UPDATE `idempotency_keys` SET `idempotency_keys`.`booking_id` = 6, `idempotency_keys`.`status` = 'completed', `idempotency_keys`.`updated_at` = '2026-06-14 07:30:41.161583' WHERE `idempotency_keys`.`id` = 5

    def create_booking!(params)
      room = Room.find_by(id: params[:room_id])
      raise NotFoundError, "Room not found" unless room

      times = BookingRules.validate!(
        start_time: params[:start_time],
        end_time: params[:end_time]
      )

      start_time = times[:start_time]
      end_time = times[:end_time]

      if BookingRules.overlapping?(
        room_id: room.id,
        start_time: start_time,
        end_time: end_time
      )
        raise ConflictError, "Booking overlaps with an existing confirmed booking"
      end

      Booking.create!(
        room: room,
        title: params[:title],
        organizer_email: params[:organizer_email],
        start_time: start_time,
        end_time: end_time,
        status: "confirmed"
      )
---
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 1 LIMIT 1
INSERT INTO `bookings` (`room_id`, `title`, `organizer_email`, `start_time`, `end_time`, `status`, `created_at`, `updated_at`) VALUES (1, 'Daily Standup', 'john@example.com', '2026-07-14 09:00:00', '2026-07-14 10:00:00', 'confirmed', '2026-06-14 07:30:41.156964', '2026-06-14 07:30:41.156964')