meeting-room-booking/app/services/cancellation_service.rb

SELECT `bookings`.* FROM `bookings` WHERE `bookings`.`id` = 1 LIMIT 1
UPDATE `bookings` SET `bookings`.`status` = 'cancelled', `bookings`.`updated_at` = '2026-06-14 07:28:46.031410' WHERE `bookings`.`id` = 1
---
    def cancel(booking_id)
      booking = Booking.find_by(id: booking_id)
      raise NotFoundError, "Booking not found" unless booking

      return booking if booking.cancelled?

      unless BookingRules.cancellation_allowed?(booking)
        raise ValidationError,
              "Booking can only be cancelled at least 1 hour before start time"
      end

      booking.update!(status: "cancelled")