meeting-room-booking/app/services/room_service.rb

INSERT INTO `rooms` (`name`, `capacity`, `floor`, `created_at`, `updated_at`) VALUES ('Orion3', 10, 2, '2026-06-14 07:52:19.671087', '2026-06-14 07:52:19.671087')
INSERT INTO `room_amenities` (`room_id`, `amenity`, `created_at`, `updated_at`) VALUES (4, 'TV', '2026-06-14 07:52:19.688959', '2026-06-14 07:52:19.688959')
---
    def create(params)
      amenities = Array(params[:amenities]).compact
      room = Room.new(
        name: params[:name],
        capacity: params[:capacity],
        floor: params[:floor]
      )

      return room unless room.save

      amenities.each do |amenity|
        room.room_amenities.create!(amenity: amenity)