meeting-room-booking/app/services/utilization_service.rb

SELECT `rooms`.* FROM `rooms` ORDER BY `rooms`.`id` ASC
---
    def generate(from, to)
      from_time = Time.iso8601(from.to_s)
      to_time = Time.iso8601(to.to_s)
      total_business_hours = BookingRules.business_hours_between(from_time, to_time)

      Room.includes(:confirmed_bookings).order(:id).map do |room|